<template>
  <div class="catalog__container">
    <div class="catalog__list">
      <div
        v-for="company in companyRender"
        :key="company.id"
        class="catalog__item"
      >
        <div class="catalog__item-logo"><img :src="company.picture" /></div>
        <div class="catalog__item-about">
          <div class="catalog__company-name">
            {{ company.title }}
          </div>
          <div class="catalog__company-description">
            {{ company.description_short }}
          </div>
          <div class="catalog__company-tag-blocks">
            <div
              v-for="tag in company.industries"
              :key="tag.id"
              class="catalog__company-tag"
            >
              {{ tag.title }}
            </div>
          </div>
        </div>
        <div class="catalog__arrow">
          <fa icon="arrow-right" />
        </div>
      </div>
    </div>
    <div class="pagination">
      <div
        @click="paginationChange(item)"
        class="pagination__item"
        v-for="item in paginationList"
        :key="item.index"
        :class="{ pagination__item_active: item == currentList }"
      >
        {{ item }}
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      currentList: 1,
      companyRender: [],
      getComapnyInfo: [
        {
          id: 1,
          logo: "logo",
          name: "SAP Software1",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 2,
          logo: "logo",
          name: "SAP Software2",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 3,
          logo: "logo",
          name: "SAP Software3",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 4,
          logo: "logo",
          name: "SAP Software4",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 5,
          logo: "logo",
          name: "SAP Software5",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 6,
          logo: "logo",
          name: "SAP Software6",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 7,
          logo: "logo",
          name: "SAP Software7",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 8,
          logo: "logo",
          name: "SAP Software8",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 9,
          logo: "logo",
          name: "SAP Software9",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 10,
          logo: "logo",
          name: "SAP Software10",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 11,
          logo: "logo",
          name: "SAP Software11",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 12,
          logo: "logo",
          name: "SAP Software12",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 13,
          logo: "logo",
          name: "SAP Software13",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 14,
          logo: "logo",
          name: "SAP Software14",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 15,
          logo: "logo",
          name: "SAP Software15",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 16,
          logo: "logo",
          name: "SAP Software16",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 17,
          logo: "logo",
          name: "SAP Software17",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 18,
          logo: "logo",
          name: "SAP Software18",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 19,
          logo: "logo",
          name: "SAP Software19",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 20,
          logo: "logo",
          name: "SAP Software20",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 21,
          logo: "logo",
          name: "SAP Software21",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 22,
          logo: "logo",
          name: "SAP Software22",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 23,
          logo: "logo",
          name: "SAP Software23",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 24,
          logo: "logo",
          name: "SAP Software24",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 25,
          logo: "logo",
          name: "SAP Software25",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 26,
          logo: "logo",
          name: "SAP Software26",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 27,
          logo: "logo",
          name: "SAP Software27",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 28,
          logo: "logo",
          name: "SAP Software28",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 29,
          logo: "logo",
          name: "SAP Software29",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 30,
          logo: "logo",
          name: "SAP Software30",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 31,
          logo: "logo",
          name: "SAP Software31",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 32,
          logo: "logo",
          name: "SAP Software32",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 33,
          logo: "logo",
          name: "SAP Software33",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 34,
          logo: "logo",
          name: "SAP Software34",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 35,
          logo: "logo",
          name: "SAP Software35",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 36,
          logo: "logo",
          name: "SAP Software36",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 37,
          logo: "logo",
          name: "SAP Software37",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 38,
          logo: "logo",
          name: "SAP Software38",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 39,
          logo: "logo",
          name: "SAP Software39",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 40,
          logo: "logo",
          name: "SAP Software40",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 41,
          logo: "logo",
          name: "SAP Software41",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 42,
          logo: "logo",
          name: "SAP Software42",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 43,
          logo: "logo",
          name: "SAP Software43",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 44,
          logo: "logo",
          name: "SAP Software44",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 45,
          logo: "logo",
          name: "SAP Software45",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 46,
          logo: "logo",
          name: "SAP Software46",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 47,
          logo: "logo",
          name: "SAP Software47",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 48,
          logo: "logo",
          name: "SAP Software48",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 49,
          logo: "logo",
          name: "SAP Software49",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 50,
          logo: "logo",
          name: "SAP Software50",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 51,
          logo: "logo",
          name: "SAP Software51",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 52,
          logo: "logo",
          name: "SAP Software52",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 53,
          logo: "logo",
          name: "SAP Software53",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 54,
          logo: "logo",
          name: "SAP Software54",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 55,
          logo: "logo",
          name: "SAP Software55",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 56,
          logo: "logo",
          name: "SAP Software56",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 57,
          logo: "logo",
          name: "SAP Software57",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 58,
          logo: "logo",
          name: "SAP Software58",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 59,
          logo: "logo",
          name: "SAP Software59",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 60,
          logo: "logo",
          name: "SAP Software60",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 61,
          logo: "logo",
          name: "SAP Software61",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 62,
          logo: "logo",
          name: "SAP Software62",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 63,
          logo: "logo",
          name: "SAP Software63",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 64,
          logo: "logo",
          name: "SAP Software64",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 65,
          logo: "logo",
          name: "SAP Software65",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 66,
          logo: "logo",
          name: "SAP Software66",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 67,
          logo: "logo",
          name: "SAP Software67",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 68,
          logo: "logo",
          name: "SAP Software68",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 69,
          logo: "logo",
          name: "SAP Software69",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 70,
          logo: "logo",
          name: "SAP Software70",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 71,
          logo: "logo",
          name: "SAP Software71",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 72,
          logo: "logo",
          name: "SAP Software72",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 73,
          logo: "logo",
          name: "SAP Software73",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 74,
          logo: "logo",
          name: "SAP Software74",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 75,
          logo: "logo",
          name: "SAP Software75",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 76,
          logo: "logo",
          name: "SAP Software76",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 77,
          logo: "logo",
          name: "SAP Software77",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 78,
          logo: "logo",
          name: "SAP Software78",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 79,
          logo: "logo",
          name: "SAP Software79",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 80,
          logo: "logo",
          name: "SAP Software80",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 81,
          logo: "logo",
          name: "SAP Software81",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 82,
          logo: "logo",
          name: "SAP Software82",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 83,
          logo: "logo",
          name: "SAP Software83",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 84,
          logo: "logo",
          name: "SAP Software84",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 85,
          logo: "logo",
          name: "SAP Software85",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 86,
          logo: "logo",
          name: "SAP Software86",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 87,
          logo: "logo",
          name: "SAP Software87",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 88,
          logo: "logo",
          name: "SAP Software88",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 89,
          logo: "logo",
          name: "SAP Software89",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 90,
          logo: "logo",
          name: "SAP Software90",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 91,
          logo: "logo",
          name: "SAP Software91",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 92,
          logo: "logo",
          name: "SAP Software92",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 93,
          logo: "logo",
          name: "SAP Software93",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 94,
          logo: "logo",
          name: "SAP Software94",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 95,
          logo: "logo",
          name: "SAP Software95",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 96,
          logo: "logo",
          name: "SAP Software96",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 97,
          logo: "logo",
          name: "SAP Software97",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 98,
          logo: "logo",
          name: "SAP Software98",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
        {
          id: 99,
          logo: "logo",
          name: "SAP Software99",
          description:
            "Подразделение международной компании SAP SE, мирового лидера на рынке корпоративных приложений. Решениями и ...",
          tag: [
            {
              tag: "IT Технологии",
            },
            {
              tag: "Сельское хозяйство",
            },
            {
              tag: "Клининг",
            },
          ],
          hover: false,
        },
      ],
      paginationList: [],
    };
  },
  methods: {
    async getCompany() {
      const res = await fetch("http://api-test.duotek.ru/companies");
      const data = await res.json();
      this.getComapnyInfo = data.data;
      this.paginationListRender();
      this.companyListRender();
    },
    // метод обновляет значение текущего листа пагинации
    paginationChange(item) {
      if (item !== "...") {
        this.currentList = +item;
        this.paginationListRender(); // запускаем ререндор листа пагинации
        this.companyListRender(); // запускаем ререндор отрисованного листа
      }
    },
    // метод возвращает массив пагинации
    paginationListRender() {
      const pagesNum = Math.round(this.getComapnyInfo.length / 10);
      // если количество страниц для пагинации > 9 будет появляться ...
      if (pagesNum > 9) {
        // если выбранная страница < 5 ... будет в конце
        if (this.currentList <= 4) {
          this.paginationList = [1, 2, 3, 4, 5, 6, "...", pagesNum];
        }
        // если выбранная страница < 5 < ... будет в конце и в начале
        else if (this.currentList >= 5 && this.currentList + 3 < pagesNum) {
          this.paginationList = [
            1,
            "...",
            this.currentList - 2,
            this.currentList - 1,
            this.currentList,
            this.currentList + 1,
            this.currentList + 2,
            "...",
            pagesNum,
          ];
        } else {
          this.paginationList = [
            1,
            "...",
            pagesNum - 5,
            pagesNum - 4,
            pagesNum - 3,
            pagesNum - 2,
            pagesNum - 1,
            pagesNum,
          ];
        }
      }
      // если страниц меньше 9 отрисует от 1 до 9, без ...
      else {
        this.paginationList = pagesNum;
      }
    },
    // метод отрисовывает компании в зависимости от выбраного листа
    companyListRender() {
      this.companyRender = this.getComapnyInfo.slice(
        (this.currentList - 1) * 10,
        (this.currentList - 1) * 10 + 10
      );
    },
  },
  mounted() {
    this.getCompany();
  },
};
</script>

<style lang="scss" scoped>
.catalog__container {
  width: 1200px;
  margin: auto;
}
.catalog__list {
  width: 792px;
  margin-top: -120px;
  position: relative;
  margin-bottom: 20px;
}
.catalog__item {
  display: flex;
  width: 792px;
  height: 208px;
  padding: 32px 23px 0px 32px;
}
.catalog__item:hover {
  cursor: pointer;
  background: rgba(3, 9, 83, 0.03);
  .catalog__company-name {
    color: #ef3e4a;
  }
  .catalog__company-tag {
    background-color: white;
  }
  .catalog__arrow {
    display: block;
  }
}
.catalog__item-logo {
  width: 160px;
}
.catalog__item-about {
  width: 530px;
}
.catalog__company-name {
  font-size: 24px;
  color: #030953;
  font-weight: bold;
  margin-bottom: 15px;
}
.catalog__company-description {
  font-size: 14px;
  line-height: 150%;
  color: #333333;
}
.catalog__company-tag-blocks {
  display: flex;
  margin-top: 16px;
}
.catalog__company-tag {
  background: #f7f7f7;
  border-radius: 200px;
  height: 32px;
  padding: 5px 13px 5px 13px;
  margin-right: 4px;
  font-size: 14px;
  color: #333333;
}

.catalog__arrow {
  display: none;
  margin-top: 132px;
  color: #ef3e4a;
  width: 47px;
  text-align: right;
}
.pagination {
  margin: auto;
  width: 9 * 40px;
  height: 40px;
  display: flex;
  margin-top: 20px;
  margin-bottom: 44px;
}
.pagination__item {
  display: flex;
  justify-content: center;
  align-items: center;
  width: 40px;
  height: 40px;
  cursor: pointer;
}
.pagination__item_active {
  background: #f7f7f7;
  border-radius: 4px;
  color: #808080;
}
</style>
